Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_compute_instance.test-instance-a will be created
+ resource "yandex_compute_instance" "test-instance-a" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDMlhKEQ/MFSZhD0z9X3YuEDQTRNglHxZ5d2ntb4rpHa23OQiZxpMm6PC+Uiw5rU6TjfXnkiWuZ9s1p9p+oJWeNCIAxNPyMzwHC2s35zI2UftKomU5at7r4zq/N1G9D8hS5dxDCQO6U7Y7Cu9J0TiGamcvhI49m5VarERlMmEsj6SSzH1bKGaIDRCngVzjr+DjCRR4Il2qe82xP7wck0hPllC/ptqLREzbiGMLdrh5ZknGPXyThR/i55yy94gL45HKIRJsdbtA6E6VLIVLjZwseEoZmoDfrFt/PeOWQVeHs96kyWvGnaF+YDS0ozbujIo2SVUk9GxwsHBOluKIpLUUhML2DIuyqYH2qvHg8/wstd/HYBSUsIXbGnWNNwy2AlYacAVJSuWq3tL0+R0A5j0ayEjnW2f+bBQuBzq8ssjqhs//B9LBvWNwIJCTa+ImqSUgup63yKqDmjJ5oYKIGEYg1/fa42/HyGQs8gESW9bSZdPSCZgwkCjgU7sgmG9lS+0c= demo
            EOT
        }
      + name                      = "test-instance-a"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-a"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8haecqq3rn9ch89eua"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.10.11"
          + ipv4               = true
          + ipv6               = false
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.test-instance-b will be created
+ resource "yandex_compute_instance" "test-instance-b" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDMlhKEQ/MFSZhD0z9X3YuEDQTRNglHxZ5d2ntb4rpHa23OQiZxpMm6PC+Uiw5rU6TjfXnkiWuZ9s1p9p+oJWeNCIAxNPyMzwHC2s35zI2UftKomU5at7r4zq/N1G9D8hS5dxDCQO6U7Y7Cu9J0TiGamcvhI49m5VarERlMmEsj6SSzH1bKGaIDRCngVzjr+DjCRR4Il2qe82xP7wck0hPllC/ptqLREzbiGMLdrh5ZknGPXyThR/i55yy94gL45HKIRJsdbtA6E6VLIVLjZwseEoZmoDfrFt/PeOWQVeHs96kyWvGnaF+YDS0ozbujIo2SVUk9GxwsHBOluKIpLUUhML2DIuyqYH2qvHg8/wstd/HYBSUsIXbGnWNNwy2AlYacAVJSuWq3tL0+R0A5j0ayEjnW2f+bBQuBzq8ssjqhs//B9LBvWNwIJCTa+ImqSUgup63yKqDmjJ5oYKIGEYg1/fa42/HyGQs8gESW9bSZdPSCZgwkCjgU7sgmG9lS+0c= demo
            EOT
        }
      + name                      = "test-instance-b"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-b"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8haecqq3rn9ch89eua"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.20.11"
          + ipv4               = true
          + ipv6               = false
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_compute_instance.test-master-c will be created
+ resource "yandex_compute_instance" "test-master-c" {
      + created_at                = (known after apply)
      + folder_id                 = (known after apply)
      + fqdn                      = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + metadata                  = {
          + "ssh-keys" = <<-EOT
                ubuntu:ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDMlhKEQ/MFSZhD0z9X3YuEDQTRNglHxZ5d2ntb4rpHa23OQiZxpMm6PC+Uiw5rU6TjfXnkiWuZ9s1p9p+oJWeNCIAxNPyMzwHC2s35zI2UftKomU5at7r4zq/N1G9D8hS5dxDCQO6U7Y7Cu9J0TiGamcvhI49m5VarERlMmEsj6SSzH1bKGaIDRCngVzjr+DjCRR4Il2qe82xP7wck0hPllC/ptqLREzbiGMLdrh5ZknGPXyThR/i55yy94gL45HKIRJsdbtA6E6VLIVLjZwseEoZmoDfrFt/PeOWQVeHs96kyWvGnaF+YDS0ozbujIo2SVUk9GxwsHBOluKIpLUUhML2DIuyqYH2qvHg8/wstd/HYBSUsIXbGnWNNwy2AlYacAVJSuWq3tL0+R0A5j0ayEjnW2f+bBQuBzq8ssjqhs//B9LBvWNwIJCTa+ImqSUgup63yKqDmjJ5oYKIGEYg1/fa42/HyGQs8gESW9bSZdPSCZgwkCjgU7sgmG9lS+0c= demo
            EOT
        }
      + name                      = "test-master-c"
      + network_acceleration_type = "standard"
      + platform_id               = "standard-v1"
      + service_account_id        = (known after apply)
      + status                    = (known after apply)
      + zone                      = "ru-central1-c"

      + boot_disk {
          + auto_delete = true
          + device_name = (known after apply)
          + disk_id     = (known after apply)
          + mode        = (known after apply)

          + initialize_params {
              + block_size  = (known after apply)
              + description = (known after apply)
              + image_id    = "fd8haecqq3rn9ch89eua"
              + name        = (known after apply)
              + size        = 50
              + snapshot_id = (known after apply)
              + type        = "network-ssd"
            }
        }

      + network_interface {
          + index              = (known after apply)
          + ip_address         = "192.168.30.7"
          + ipv4               = true
          + ipv6               = false
          + ipv6_address       = (known after apply)
          + mac_address        = (known after apply)
          + nat                = true
          + nat_ip_address     = (known after apply)
          + nat_ip_version     = (known after apply)
          + security_group_ids = (known after apply)
          + subnet_id          = (known after apply)
        }

      + placement_policy {
          + host_affinity_rules = (known after apply)
          + placement_group_id  = (known after apply)
        }

      + resources {
          + core_fraction = 20
          + cores         = 2
          + memory        = 2
        }

      + scheduling_policy {
          + preemptible = true
        }
    }

  # yandex_container_registry.default will be created
+ resource "yandex_container_registry" "default" {
      + created_at = (known after apply)
      + folder_id  = (known after apply)
      + id         = (known after apply)
      + name       = "demo-registry"
      + status     = (known after apply)
    }

  # yandex_vpc_network.netology-net will be created
+ resource "yandex_vpc_network" "netology-net" {
      + created_at                = (known after apply)
      + default_security_group_id = (known after apply)
      + folder_id                 = (known after apply)
      + id                        = (known after apply)
      + labels                    = (known after apply)
      + name                      = "netology-net"
      + subnet_ids                = (known after apply)
    }

  # yandex_vpc_subnet.public-a will be created
+ resource "yandex_vpc_subnet" "public-a" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-a"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.10.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-a"
    }

  # yandex_vpc_subnet.public-b will be created
+ resource "yandex_vpc_subnet" "public-b" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-b"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.20.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-b"
    }

  # yandex_vpc_subnet.public-c will be created
+ resource "yandex_vpc_subnet" "public-c" {
      + created_at     = (known after apply)
      + folder_id      = (known after apply)
      + id             = (known after apply)
      + labels         = (known after apply)
      + name           = "public-c"
      + network_id     = (known after apply)
      + v4_cidr_blocks = [
          + "192.168.30.0/24",
        ]
      + v6_cidr_blocks = (known after apply)
      + zone           = "ru-central1-c"
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ registry-id                 = (known after apply)
+ test-instance-a-external-ip = (known after apply)
+ test-instance-a-internal-ip = "192.168.10.11"
+ test-instance-b-external-ip = (known after apply)
+ test-instance-b-internal-ip = "192.168.20.11"
+ test-master-c-external-ip   = (known after apply)
+ test-master-c-internal-ip   = "192.168.30.7"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-0:4141/lock?id=town0wl%252Fneto-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
